# BarTypeId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainerItem..::..BarTypeId Property
RebarContainerItem Class See Also
---
The identifier of the rebar bar type.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public ElementId BarTypeId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BarTypeId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ BarTypeId {
	ElementId^ get ();
}
```

# See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace